tutorials/mesh/snappyHexMesh/addLayersToFaceZone/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


runApplication blockMesh

runApplication topoSet

runApplication snappyHexMesh -overwrite

runApplication checkMesh

runApplication simpleFoam

# ----------------------------------------------------------------- end-of-file
